In [49]:
import pandas as pd
import numpy as np

# 数据写入

In [ ]:
# df = pd.read_csv('D:\\vscode_code\\数据集\\learn_pandas.csv')

In [51]:
#df

In [52]:
#pd = pd.read_table('D:\\vscode_code\\数据集\\ch2\\my_table.txt')

# 数据写出

In [53]:
#df.to_csv('D:\\vscode_code\\数据集\\test.csv',index = False)

In [54]:
#基础数据结构

# series

In [55]:
s = pd.Series(data = ['1',2,{'dic':3}],
              index = ['line0','line1','line2'],
              name = 'line',
              dtype = 'object')

In [56]:
s

line0             1
line1             2
line2    {'dic': 3}
Name: line, dtype: object

In [57]:
s.name

'line'

In [58]:
s.dtype

dtype('O')

In [59]:
s.index

Index(['line0', 'line1', 'line2'], dtype='object')

In [60]:
s.values

array(['1', 2, {'dic': 3}], dtype=object)

# dataFrame

In [61]:
df = pd.DataFrame(data = [[1,2,3],
                          [4,5,6],
                          [7,8,9]],
                  index = pd.Index(['ln0','ln1','ln2']),
                  columns = pd.Index(['col1','col2','col3']))

In [62]:
df

     col1  col2  col3
ln0     1     2     3
ln1     4     5     6
ln2     7     8     9

In [98]:
df_str = pd.DataFrame(data ={'col1' :['a','b','c'],
                           'col3' : ['ca','ac','cd'],
                           'col2' : ['p','java','python']},
                    index = ['%d'%i for i in range(3)]
                    )

In [99]:
df_str

  col1 col3    col2
0    a   ca       p
1    b   ac    java
2    c   cd  python

In [65]:
df1 = pd.DataFrame(data = [[1,2,3],
                           [4,5,6],
                           [7,8,9]],
                    index = ['(%d)'%i for i in range(3)],
                    columns = ['col1','col2','col3'])

In [66]:
df1

     col1  col2  col3
(0)     1     2     3
(1)     4     5     6
(2)     7     8     9

In [67]:
df.index

Index(['ln0', 'ln1', 'ln2'], dtype='object')

In [68]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [69]:
df.values #dataFrame 的值

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [70]:
df.dtypes #dataFrame 的类型

col1    int64
col2    int64
col3    int64
dtype: object

In [71]:
df.shape #dataFrame 的长度

(3, 3)

In [72]:
df.T #dataFrame 的 转置

      ln0  ln1  ln2
col1    1    4    7
col2    2    5    8
col3    3    6    9

In [74]:
df = df[df.columns[:2]]

In [75]:
df

     col1  col2
ln0     1     2
ln1     4     5
ln2     7     8

## 汇总函数

In [77]:
df.head() #默认前5行

     col1  col2
ln0     1     2
ln1     4     5
ln2     7     8

In [79]:
df.head(2) #前2行数据

     col1  col2
ln0     1     2
ln1     4     5

In [80]:
df.tail(2) #后2行数据

     col1  col2
ln1     4     5
ln2     7     8

In [82]:
df.info() #查看dataFrame的整体结构
        #<class>表示dataFrame的类
        #index 表示索引的值和数量
        #Data columns 表示总共有多少列
        #DataFrame 表的内容
        #Non-Null Count表示值为非空的数量
        #dtypes 表示类型 
        #memory usage 表示内存

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, ln0 to ln2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      int64
 1   col2    3 non-null      int64
dtypes: int64(2)
memory usage: 180.0+ bytes

In [83]:
df.describe()#对dataFrame进行常见的数据分析
            #count表示列中非空值的数量
            #mean 均值
            #std 表示标准差，来数据的表示离散程度
            #min 列中最小值
            #max 列中最大值
            #25% %25的数据，第一个四分位数(下四分位数)
            #50% 50%的数据，第二个四分位数(中位数)
            #75% 75%的数据, 第三个四分位数(上四分位数)

       col1  col2
count   3.0   3.0
mean    4.0   5.0
std     3.0   3.0
min     1.0   2.0
25%     2.5   3.5
50%     4.0   5.0
75%     5.5   6.5
max     7.0   8.0

## 特征统计函数

In [92]:
df

     col1  col2
ln0     1     2
ln1     4     5
ln2     7     8

In [88]:
df.max() #计算每列最大值

col1    7
col2    8
dtype: int64

In [100]:
df_str

  col1 col3    col2
0    a   ca       p
1    b   ac    java
2    c   cd  python

In [ ]:
df_str.max()#同长度按ascll码,不同长度按字符串长度;长度相同时，依次匹配字母的ASCILL码值,直到匹配出为止

col1         c
col3        cd
col2    python
dtype: object

In [102]:
df.min()

col1    1
col2    2
dtype: int64

In [103]:
df_str.min()

col1       a
col3      ac
col2    java
dtype: object

In [ ]:
df.mean()#均值

col1    4.0
col2    5.0
dtype: float64

In [ ]:
df.quantile(0.25)#默认为0.5，即中位数;0.25/0.75计算上下四分位数

col1    5.5
col2    6.5
Name: 0.75, dtype: float64

In [ ]:
df.count()#计算非空值的数量

col1    3
col2    3
dtype: int64

In [ ]:
df.count(axis = 1)#计算行的非空值数量 默认axis = 0 即：列，axis = 1 即：行

ln0    2
ln1    2
ln2    2
dtype: int64

In [ ]:
df.idxmax()#返回最大值的索引

col1    ln2
col2    ln2
dtype: object

**这些函数返回的都是标量,又称为聚合函数,其中他们都有一个参数为 axis，默认为0 即行。当为1时，为列**

# 唯一值函数

In [117]:
df

     col1  col2
ln0     1     2
ln1     4     5
ln2     7     8

In [ ]:
df['col1'].unique()#返回不重复的值的第一次出现的值，按照dataFrame列中原本的数据

array([1, 4, 7])

In [ ]:
df['col1'].nunique(dropna = True)#不重复值的数量
                                #dropna默认为True 不会缺失值作为特殊的一个值计算
                                #dropna为False时 会吧缺失值作为一个特殊值计算

3

In [ ]:
df['col1'].value_counts()#返回重复出现的值和他的重复数量 默认按照频数从高到低排序

col1
1    1
4    1
7    1
Name: count, dtype: int64

In [125]:
df_csv = pd.read_csv('D:\\vscode_code\\数据集\\learn_pandas.csv')

In [126]:
df_csv

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,C,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,D,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,A,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,A,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,D,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [130]:
df_demo = df_csv[['School','Transfer','Gender']]

In [131]:
df_demo

    School Transfer  Gender
0        A        N  Female
1        B        N    Male
2        A        N    Male
3        C        N  Female
4        C        N    Male
..     ...      ...     ...
195      C        N  Female
196      D        N  Female
197      A        N  Female
198      A        N    Male
199      D        N    Male

[200 rows x 3 columns]

In [ ]:
df_demo.drop_duplicates()#m默认比较所有行，将不重复的值输出出来

    School Transfer  Gender
0        A        N  Female
1        B        N    Male
2        A        N    Male
3        C        N  Female
4        C        N    Male
5        D        N  Female
9        B        N  Female
12       A      NaN  Female
16       D        N    Male
21       A      NaN    Male
36       B        Y    Male
43       D        Y  Female
69       D      NaN  Female
74       D        Y    Male
84       C      NaN  Female
102      B      NaN    Male
120      B      NaN  Female
131      C        Y    Male

In [ ]:
df_demo.drop_duplicates(['School','Transfer'])#指定行，根据指定的行比较值是否重复，将不重复的值输出出来

    School Transfer  Gender
0        A        N  Female
1        B        N    Male
3        C        N  Female
5        D        N  Female
12       A      NaN  Female
36       B        Y    Male
43       D        Y  Female
69       D      NaN  Female
84       C      NaN  Female
102      B      NaN    Male
131      C        Y    Male

In [ ]:
df_demo.drop_duplicates(keep = 'last')#keep 默认为first 保留第一次出现的行
                                    #last 保留最后一次出现的行
                                    # False 不保留重复的行，若重复则删去

    School Transfer  Gender
21       A      NaN    Male
54       B        Y    Male
84       C      NaN  Female
123      A      NaN  Female
127      B        N    Male
131      C        Y    Male
147      B      NaN    Male
150      D        Y    Male
152      C        N    Male
169      D        Y  Female
176      D      NaN  Female
185      B        N  Female
194      B      NaN  Female
195      C        N  Female
196      D        N  Female
197      A        N  Female
198      A        N    Male
199      D        N    Male

In [139]:
df_demo.drop_duplicates(keep = 'first')

    School Transfer  Gender
0        A        N  Female
1        B        N    Male
2        A        N    Male
3        C        N  Female
4        C        N    Male
5        D        N  Female
9        B        N  Female
12       A      NaN  Female
16       D        N    Male
21       A      NaN    Male
36       B        Y    Male
43       D        Y  Female
69       D      NaN  Female
74       D        Y    Male
84       C      NaN  Female
102      B      NaN    Male
120      B      NaN  Female
131      C        Y    Male

In [141]:
df_demo.drop_duplicates(keep = False)

    School Transfer  Gender
21       A      NaN    Male
84       C      NaN  Female
131      C        Y    Male

In [ ]:

df_demo.duplicated(['School','Transfer']).head() #比较列中元素是否与前面的列中元素相同，相同则标记为True，否则为False

0    False
1    False
2     True
3    False
4     True
dtype: bool

# 替换函数

(1) 映射替换 使用replace函数 将指定的值替换为其他值

(2) 逻辑替换  

(3) 正则替换

In [ ]:
df_demo['Gender'].replace({'Male':1,'Female':0}).head() #将Gender列中的male替换为1，Female替换为0

C:\Users\15784\AppData\Local\Temp\ipykernel_19000\1334602399.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_demo['Gender'].replace({'Male':1,'Female':0}).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [ ]:
df_demo['Gender'].replace(['Male','Female'],[1,0]).head()#将Gender列中的male替换为1，Female替换为0b

C:\Users\15784\AppData\Local\Temp\ipykernel_19000\2698951119.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_demo['Gender'].replace(['Male','Female'],[1,0]).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [152]:
s = pd.Series(data = ['a',1,2,'b',1,1,'a'])

In [153]:
s

0    a
1    1
2    2
3    b
4    1
5    1
6    a
dtype: object

In [ ]:
#replace中有关键字method,其中method有ffill(向前填充),bfill(向后填充)
s.replace([1,2],method = 'ffill')#被替换的数字向前寻找替换的字母，然后变成替换的字母。

C:\Users\15784\AppData\Local\Temp\ipykernel_19000\2773248280.py:2: FutureWarning: The 'method' keyword in Series.replace is deprecated and will be removed in a future version.
  s.replace([1,2],method = 'ffill')#被替换的数字向前替换的字母，然后变成替换的数字。

0    a
1    a
2    a
3    b
4    b
5    b
6    a
dtype: object

In [ ]:
s.replace([1,2],method = 'bfill'),#[1,2]向后寻找替换的字母,然后被替换

C:\Users\15784\AppData\Local\Temp\ipykernel_19000\4140214527.py:1: FutureWarning: The 'method' keyword in Series.replace is deprecated and will be removed in a future version.
  s.replace([1,2],method = 'bfill')

0    a
1    b
2    b
3    b
4    a
5    a
6    a
dtype: object